Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་རྣམས་ལ་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་པ་ཡིན་ནོ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they are stable in the extrasensory powers and act for the benefit of beings. “

source: །དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པ་དེ་ཉིད་ཀྱིས། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་། ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མཐོང་སྟེ། དེ་དེ་དག་ཏུ་རྫུ་འཕྲུལ་གྱིས་སོང་ཞིང་སྦྱིན་པ་འམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པ་འམ།
en: Through pure divine clairvoyance itself, surpassing that of human beings, they see all world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith.

source: བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ། ཤེས་རབ་བམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ།
en: Traversing all these through miraculous ability, they act for the benefit of beings by means of generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, the factors conducive to enlightenment, the gateways of liberation—emptiness, signlessness, and wishlessness—the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the meditative stabilities, the serial steps of meditative absorption, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, or the attributes of the buddhas.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ།
en: In that way they act on behalf of those beings. “

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཅིང་སེམས་ཅན་དེ་དག་གི་བྱ་བ་བྱེད་དེ། དེ་ལ་སེམས་ཅན་སེར་སྣ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། སྦྱིན་པ་བྱིན་ཅིག །
en: To all those beings who are miserly they teach the Dharma, saying, ‘You should give gifts!

source: གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཀྱིས། དེ་ལྟར་ཁྱེད་ཀྱིས་སྦྱིན་པ་བྱིན་ལ་བདག་ཀྱང་བདེ་བར་གྱིས་ཤིག །གཞན་ཡང་བདེ་བར་གྱིས་ཤིག །
en: So you should give gifts, and ensure that you yourself will be happy and that others too will be happy.

source: ཕོངས་པས་ཟིལ་གྱིས་ནོན་ཅིང་ཉིང་ཤ་ཉིང་གིས་ཟོས་ཏེ། ངན་སོང་གསུམ་ལས་མི་ཐར་བར་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: Those who are oppressed by deprivation, consuming one another’s flesh, cannot be liberated from the three inferior realms.’ “

source: །སེམས་ཅན་ཚུལ་ཁྲིམས་ངན་པ་ཅན་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ཚུལ་ཁྲིམས་ངན་པ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who indulge in immorality, they teach the Dharma, saying, ‘O people, immorality is imbued with suffering.

source: ཚུལ་ཁྲིམས་ངན་པའི་རྣམ་པར་སྨིན་པ་ནི་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of immorality is [rebirth in] the hells, the animal realm, or the world of Yama.

source: དེ་ལྟ་བས་ན་ཁྱེད་ཕན་ཚུན་སེམས་འཁྲུགས་པར་གྱུར་ན། སེམས་ཅན་དམྱལ་བར་སྐྱེ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེ་བ་འམ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བའི་གནས་ཡིན་གྱིས།
en: If you resort to anger for one another in that manner, you will be reborn in the hells, you will be reborn in the animal realm, or you will be reborn in the world of Yama.

source: དེ་བས་ན་ཁྱེད་ཀྱིས་འཁྲུགས་པའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of anger [to arise] and later you will not be remorseful!’ “

source: །སེམས་ཅན་ལེ་ལོ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ལེ་ལོ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who are indolent, they teach the Dharma, saying, ‘O people, indolence is imbued with suffering.

source: ལེ་ལོས་ནི་བདག་གི་དོན་ཀྱང་བྱ་བར་མི་ནུས་ན། གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཏེ།
en: Through indolence you cannot achieve your own welfare, let alone the welfare of others.

source: དེའི་ཕྱིར་ཁྱེད་ཀྱིས་ལེ་ལོའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of indolence [to arise] and later you will not be remorseful!’ “

source: དེ་ལྟར་ཁྱེད་ངན་སོང་གསུམ་དུ་ལྷུང་ན། བདག་ཅག་ཀྱང་གདོན་པར་མི་ནུས་ན། གཞན་གདོན་པར་ལྟ་ཅི་སྨོས་ཀྱིས།
en: If you fall into the three inferior realms in that manner, you cannot extricate yourself, let alone others.

source: །སེམས་ཅན་ཤེས་རབ་འཆལ་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ཤེས་རབ་འཆལ་པ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who have thoughts of stupidity, they teach the Dharma, saying, ‘O people, stupidity is imbued with suffering.

source: གང་ཤེས་རབ་འཆལ་པའི་རྣམ་པར་སྨིན་པ་ནི་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of stupidity is [rebirth in] the hells, the animal realm, or the world of Yama.

source: །ལམ་ངན་པར་ཞུགས་པ་གང་ཇི་སྙེད་པ་དེ་དག་ནི་ཡང་དག་པའི་ལམ་ལ་སྦྱོར་ཏེ། ཉན་ཐོས་ཀྱི་ལམ་འམ། རང་སངས་རྒྱས་ཀྱི་ལམ་མམ།
en: They engage all those who have set out on negative paths to [engage in] the correct paths, engaging them in the path of the śrāvakas, the path of the pratyekabuddhas, or the path of the buddhas.

source: སངས་རྒྱས་ཀྱི་ལམ་ལ་སྦྱོར་ཞིང་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཁྱེད་ཆོས་གང་ལ་མངོན་པར་ཞེན་པར་གྱུར་པའི་ཆོས་དེ་དག་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: To all those, they teach the Dharma, saying, ‘These phenomena on which you are fixated are empty of inherent existence.

source: སྟོང་པ་ཉིད་ལ་མངོན་པར་ཞེན་པ་མེད་དོ་ཞེས་ཆོས་སྟོན་ཏེ།
en: There is no fixation in emptiness.’ “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་མངོན་པར་ཤེས་པ་རྣམས་ལ་མི་གནས་པར་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་མི་ནུས་ཏེ།
en: Subhūti, bodhisattva great beings cannot teach the Dharma to beings without being stable in the extrasensory powers.

source: ལམ་གོལ་བར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱང་ལམ་དུ་གཟུང་བར་མི་ནུས་སོ།
en: They cannot induce beings who have set out on a mistaken path into [the correct] path. “

source: རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན་བྱ་འདབ་མ་མེད་པས་ནམ་མཁའ་ལ་འགྲོ་བར་མི་ནུས་སོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་མངོན་པར་ཤེས་པ་རྣམས་ལ་མ་རྟེན་པར་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་མི་ནུས་སོ།
en: Subhūti, just as a bird without wings can never soar in the sky, in the same way, Subhūti, bodhisattva great beings cannot teach the Dharma to beings without relying on the extrasensory powers. “

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་རྣམས་མངོན་པར་བསྒྲུབ་པར་བྱ་སྟེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they should actualize the extrasensory powers.

source: དེ་མངོན་པར་ཤེས་པ་མངོན་པར་བསྒྲུབས་པ་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཅི་བྱ་བར་དགའ་བ་དེ་བདེ་བར་བྱེད་དོ།
en: Through those extrasensory powers that they have actualized they joyfully and happily undertake to perform any deeds of benefit to beings. “

source: །དེས་ལྷའི་མིག་གིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་མཐོང་སྟེ། དེ་དག་ཏུ་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་སྐྱེས་པ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: Through divine clairvoyance they see all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and they also see all the beings who are born in them.

source: །དེ་ལྟར་མཐོང་ནས་ཀྱང་རྫུ་འཕྲུལ་གྱིས་དེ་དག་ཏུ་སོང་ཞིང་སེམས་ཅན་དེ་དག་གི་སེམས་སེམས་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱས་ནས་དེ་དང་མཐུན་པར་སྦྱིན་པའི་གཏམ་འམ།
en: Having seen them in that manner, they travel there through miraculous abilities and, after comprehending the minds of those beings with their own minds, they will then teach the Dharma in conformity with them, through sermons on generosity; {Ki.

source: ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ། འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏེ།
en: VIII: 138} sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or through sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: དེས་ལྷའི་མིག་གིས་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མཐོང་སྟེ། དེ་དག་ཏུ་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་སྐྱེས་པ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: Through divine clairvoyance they see all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, and they also see all the beings who are born in them.

source: །དེ་ལྟར་མཐོང་ནས་ཀྱང་རྫུ་འཕྲུལ་གྱིས་དེ་དག་ཏུ་སོང་ཞིང་སེམས་ཅན་དེ་དག་གི་སེམས་སེམས་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱས་ནས། དེ་དང་འཐུན་པར་སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ།
en: Having seen them in that manner, they travel there through miraculous abilities and, after comprehending the minds of those beings with their own minds, they will teach the Dharma in conformity with them, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: འཕགས་པའི་བདེན་པའི་གཏམ་འམ། འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ། །དེས་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་འདི་ལྟ་སྟེ། ལྷ་དང་མི་གཉིས་ཀའི་སྒྲ་ཡང་ཐོས་ཏེ།
en: Through divine clairaudience they indeed hear the words of gods and of human beings.

source: དེ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་ཆོས་སྟོན་པ་དེ་དག་གི་ཆོས་ལྷའི་རྣ་བས་ཉན་ཏེ་ཐོས་ནས་ཀྱང་དེ་བཞིན་ཉིད་དུ་འཛིན་ཏོ།
en: That is to say, with divine clairaudience they listen to the Dharma from all the lord buddhas who teach the Dharma in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and having heard them, they retain them just as they are.

source: །དེ་བཞིན་ཉིད་དུ་བཟུང་ནས་དེ་བཞིན་ཉིད་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ།
en: Having retained them just as they are, they will then teach the Dharma to beings, just as it is, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ། །དེ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་ཆོས་སྟོན་པ་དེ་དག་གི་ཆོས་ལྷའི་རྣ་བས་ཉན་ཏེ། ཐོས་ནས་ཀྱང་དེ་བཞིན་ཉིད་དུ་འཛིན་ཏོ། །དེ་བཞིན་ཉིད་དུ་བཟུང་ནས།
en: With divine clairaudience they listen to the Dharma from all those lord buddhas who teach the Dharma in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, and having heard them, they retain them just as they are.

source: དེ་བཞིན་ཉིད་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ་འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ། །དེ་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པ་ཤིན་དུ་རྣམ་པར་དག་པ་དང་ལྡན་པ་ཡིན་ཏེ། དེ་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པ་དེས།
en: Having retained them just as they are, they will then teach the Dharma to beings, just as it is, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཤེས་པར་བྱས་ཤིང་། དེ་དག་ལ་དེ་བཞིན་ཉིད་དུ་ཆོས་སྟོན་ཏེ། སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ་འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ།
en: They will have absolutely pure knowledge of the thought patterns [of others], and having known the minds of beings through that knowledge of their thought patterns, they will then teach them the Dharma, just as it is, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: །དེ་བདག་གམ་གཞན་གྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དེས་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་འདི་ཞེས་བྱ་བ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་བྱུང་ངོ་།
en: They will recollect a multiplicity of past lives, of themselves and of others, and through the knowledge that recollects past lives, they will indeed know, ‘These were the names of the tathāgatas, arhats, completely awakened buddhas of the past.

source: །ཞེས་བྱ་བར་ཡང་ཤེས་ཏེ།
en: They appeared along with their saṅgha of śrāvakas.’

source: སེམས་ཅན་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ལ་མོས་པ་གང་ཇི་སྙེད་པ་དེ་དག་ལ་ཡང་དག་པ་ཉིད་དུ་ཆོས་སྟོན་ཏེ། སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ།
en: They will then teach the Dharma in an authentic manner to all those beings who are intent on the recollection of past lives, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ། །དེ་རྫུ་འཕྲུལ་གྱིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སོང་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་དེ།
en: They will travel through miraculous abilities to all world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā, and venerate the lord buddhas.

source: བསྙེན་བཀུར་བྱས་ནས་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ། འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ།
en: And, having venerated them, through the wisdom of their extrasensory powers they will then teach the Dharma to beings, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration, and wisdom; or sermons on the truths of the noble ones, up to and including sermons on emancipation. “

source: །དེ་ཟག་པ་མེད་པ་མངོན་དུ་བྱ་བའི་ཤེས་པ་ཤིན་དུ་རྣམ་པར་དག་པ་དང་ལྡན་པ་ཡིན་ཏེ། དེ་ཟག་པ་མེད་པ་མངོན་དུ་བྱ་བའི་ཤེས་པ་ཤིན་དུ་རིག་པ་དེས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། སྦྱིན་པའི་གཏམ་འམ། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་གཏམ་འམ། འཕགས་པའི་བདེན་པའི་གཏམ་འམ།
en: They will have absolutely pure knowledge of the state free from contaminants that is to be brought into being, and through that absolute knowledge of the state free from contaminants that is to be brought into being, they will then teach the Dharma to beings, through sermons on generosity; sermons on ethical discipline, tolerance, perseverance, meditative concentration; and wisdom; or sermons on the truths of the noble ones, {Ki.

source: འབྱུང་བའི་གཏམ་གྱི་བར་དུ་ཆོས་སྟོན་ཏོ།
en: VIII: 139} up to and including sermons on emancipation. “

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་རྣམས་མངོན་པར་བསྒྲུབ་པར་བྱ་སྟེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they should actualize the extrasensory powers.

source: དེ་མངོན་པར་ཤེས་པ་ཤིན་དུ་འདྲིས་པ་དེ་དག་གིས་ལུས་ཅི་དང་ཇི་ལྟ་བུ་ཡོངས་སུ་བཟུང་བར་འདོད་པ་དེ་དང་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་བཟུང་ཞིང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: Those who are absolutely familiar with the extrasensory powers may assume whatever corporeal form they wish to assume, and they then act according to their resolve for the benefit of beings.

source: །བདེ་བ་འམ་སྡུག་བསྔལ་བ་དེ་དག་གིས་གོས་པར་མི་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: They will not be tainted by happiness or suffering.

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་སྐྱེས་བུ་ནི་དགོས་པ་ཐམས་ཅད་བྱེད་ཀྱང་བདེ་བ་འམ་སྡུག་བསྔལ་དེས་གོས་པར་འགྱུར་བ་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་ཞིང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཀྱང་བདེ་བ་འམ། སྡུག་བསྔལ་བ་དེས་འཕྲོགས་པར་མི་འགྱུར་རོ།
en: Subhūti, just as a man emanated by the tathāgatas carries out all objectives but will not be tainted by happiness or suffering, in the same way, Subhūti, bodhisattva great beings dwell in the perfection of wisdom, play with the extrasensory powers, and teach the Dharma in the world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā, in accordance with their resolve, but they will not be captivated by happiness or suffering. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ལྟར་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བར་བྱ་སྟེ། ཅི་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེ་ལྟར་རྩེ་བར་བྱ་སྟེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, they should play with the extrasensory powers in that manner, so as to refine the buddhafields and brings beings to maturation by all means.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་བྱས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མ་བྱས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Subhūti, bodhisattva great beings cannot attain consummate buddhahood in unsurpassed, complete enlightenment without having refined the buddhafields and without having brought beings to maturation.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལམ་གྱི་ཡན་ལག་དང་མི་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མེད་དོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: If you ask why, Subhūti, there is no unsurpassed, complete enlightenment for bodhisattva great beings who lack the aspects of the path.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལམ་གྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་ལམ་དེ་དག་གང་ལགས།
en: Subhūti then asked, “Blessed Lord, what are those aspects of the path that bodhisattva great beings should perfect, and through which they will attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དགེ་བའི་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་གྱི་ཡན་ལག་གོ །གསོལ་པ།
en: Subhūti, all virtuous attributes constitute the aspects of the path that bodhisattva great beings have,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ལམ་གྱི་ཡན་ལག་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་ལམ་གྱི་ཡན་ལག་དགེ་བའི་ཆོས་དེ་དག་གང་ལགས།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བདུན་ཅུ་བཞི་པ།
en: Blessed Lord, what then are those virtuous attributes, included among the aspects of the path, through which they will attain consummate buddhahood in unsurpassed, complete enlightenment?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། དགེ་བའི་ཆོས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་དེ་ལ་མི་རྟོག་ཅིང་དེ་ཡོངས་སུ་གཏོང་བའི་ཚེ།
en: The Blessed One replied, “From the time when they first begin to set their minds on enlightenment, virtuous attributes include the perfection of generosity when it is practiced, but without false imagination.

source: ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ནི་སྦྱིན་པའོ།
en: That is to say, when dispensing gifts, on account of the emptiness of inherent existence, they do not think in terms of the threefold interaction, ‘This is a gift.

source: །འདི་ལ་ཡོངས་སུ་བཏང་བར་བྱའོ།
en: It should be given to this one.

source: །བདག་གིས་སྦྱིན་པར་བྱའོ་ཞེས་གསུམ་པོ་དེ་དག་ལ་མི་རྟོག་པ་སྟེ།
en: I should give it.’

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་གིས་བདག་ཀྱང་འཁོར་བ་ལས་སྒྲོལ་ཞིང་གཞན་ཡང་སྒྲོལ་བ་འདི་ནི་ལམ་གྱི་ཡན་ལག་དགེ་བའི་ཆོས་སོ།
en: This perfection of generosity, through which they liberate themselves from cyclic existence and also liberate others, is a virtuous attribute included among the aspects of the path. {Ki.

source: །སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། དགེ་བའི་ཆོས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: VIII: 140} “From the time when they first begin to set their minds on enlightenment, virtuous attributes include the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom when they are practiced, but without false imagination.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། དེ་ལ་མི་རྟོག་ཅིང་ཤེས་རབ་སྒོམ་པའི་ཚེ། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ནི་ཤེས་རབ་བོ།
en: That is to say, when cultivating wisdom [and so forth], on account of the emptiness of inherent existence, they do not think in terms of the threefold interaction, ‘This is wisdom.

source: བདག་གིས་ཤེས་རབ་སྒོམ་མོ།
en: I should cultivate wisdom.

source: །འདིའི་དོན་དུ་ཤེས་རབ་སྒོམ་མོ་ཞེས་གསུམ་པོ་དེ་དག་ལ་མི་རྟོག་པ་སྟེ།
en: Wisdom should be cultivated with respect to that.’

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་གིས་བདག་ཀྱང་འཁོར་བ་ལས་སྒྲོལ་ཞིང་གཞན་ཡང་སྒྲོལ་བ་འདི་ནི་ལམ་གྱི་ཡན་ལག་དགེ་བའི་ཆོས་སོ། །སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་ཆོས་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: This perfection of wisdom [and so forth], through which they liberate themselves from cyclic existence and also liberate others, is a virtuous attribute included among the aspects of the path. “

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: From the time when they first begin to set their minds on enlightenment, the virtuous attributes of bodhisattva great beings include all the aspects of emptiness, the factors conducive to enlightenment, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas when they are practiced, but without false imagination.
